
[
    {
      "_id": "65c1382dc580ef9f80c8f7c2",
      "title": "The servant is dependent on his Lord #1",
      "description": "All human beings depend on Allah for their welfare and prevention of evil in various matters of their religion and world.",
      "translation": "O mankind, you are those in need of Allah, while Allah is the Free of need, the Praiseworthy.",
      "transliteration": "Surah Al-Fatir 35:15",
      "reference": "Surah Al-Fatir 35:15",
      "category": "The servant is dependent on his Lord",
      "arabic": "يعتمد جميع البشر على الله لرفاهيتهم ولمنع الشر في مختلف أمور دينهم ودنياهم."
    },
    {
      "_id": "65c1382dc580ef9f80c8f7c3",
      "title": "The servant is dependent on his Lord #2",
      "description": "Prophet (ﷺ) used to say after every compulsory prayer, seeking Allah's assistance and acknowledging Allah's control over all things.",
      "translation": "There is none worthy of worship except Allah alone with no partner or associate. He is the Dominion and to Him be all praise, and He is able to do all things.",
      "transliteration": "Bukhari: 844",
      "reference": "Bukhari: 844",
      "category": "The servant is dependent on his Lord",
      "arabic": "كان النبي (ﷺ) يقول بعد كل صلاة فرضية، يطلب مساعدة الله ويعترف بسيطرة الله على كل شيء."
    },
    {
      "_id": "65c1382dc580ef9f80c8f7c4",
      "title": "The reward of freeing a slave",
      "description": "A supplication to be said 10 times for the reward of freeing a slave, seeking Allah's mercy and forgiveness.",
      "translation": "None has the right to be worshipped but Allah alone, Who has no partner. His is the dominion and His is the praise, and He is Able to do all things.",
      "transliteration": "Bukhari: 6404",
      "reference": "Bukhari: 6404",
      "arabic": "دعاء يجب قوله 10 مرات لأجل مكافأة الإنسان الذي يعتق العبد، يطلب رحمة الله ومغفرته."
    },
    {
      "_id": "65c1382dc580ef9f80c8f7c5",
      "title": "Allah's guidance #1",
      "description": "A prayer seeking guidance and help from Allah, acknowledging that guidance comes only from Allah.",
      "translation": "It is You we worship and It is You we ask for help.",
      "transliteration": "Surah Al-Fatihah 1:5",
      "reference": "Surah Al-Fatihah 1:5",
      "arabic": "صلاة تطلب الهداية والمساعدة من الله، مع الاعتراف بأن الهداية تأتي فقط من الله."
    },
    {
      "_id": "65c1382dc580ef9f80c8f7c6",
      "title": "Allah's guidance #2",
      "description": "A supplication seeking guidance from Allah, recognizing Allah's control over all things.",
      "translation": "Guide me through that which there has been difference concerning the truth, verily, You are upon a straight path.",
      "transliteration": "Muslim: 770",
      "reference": "Muslim: 770",
      "arabic": "دعاء يطلب الهداية من الله، مع الاعتراف بسيطرة الله على كل شيء."
    },
    {
      "_id": "65c1382dc580ef9f80c8f7c7",
      "title": "Allah's guidance #3",
      "description": "A prayer taught by the Prophet (ﷺ) to seek assistance in remembering Allah, giving thanks, and performing worship.",
      "translation": "O Allah, help me to remember You, to give You thanks, and to perform Your worship in the best manner.",
      "transliteration": "Sahih (Albani). Abu Dawud: 1522",
      "reference": "Sahih (Albani). Abu Dawud: 1522",
      "arabic": "صلاة علمها النبي (ﷺ) لطلب المساعدة في ذكر الله وتقديم الشكر وأداء العبادة بأفضل طريقة."
    },
    {
      "_id": "65c1382dc580ef9f80c8f7c8",
      "title": "Allah's guidance #4",
      "description": "A supplication seeking guidance in the best manners, asking Allah to protect from bad manners.",
      "translation": "Guide me to the best of manners for none can guide to the best of them but You. Protect me from bad manners for none can protect against them but You.",
      "transliteration": "Muslim: 771",
      "reference": "Muslim: 771",
      "arabic": "دعاء يطلب الهداية بأفضل الأخلاق، يطلب الله أن يحمي من السلوك السيء."
    },
    {
      "_id": "65c1382dc580ef9f80c8f7c9",
      "title": "Allah's guidance #5",
      "description": "The Prophet (ﷺ) instructs Ali ibn Abi Talib (RA) to seek guidance and firmness from Allah.",
      "translation": "O Allah, I beg of Thee righteousness and adhering to the straight path.",
      "transliteration": "Muslim: 2725",
      "reference": "Muslim: 2725",
      "arabic": "النبي (ﷺ) يوجه علي بن أبي طالب (رضي الله عنه) أن يطلب الهداية والثبات من الله."
    },
    {
      "_id": "65c1382dc580ef9f80c8f7ca",
      "title": "Allah's guidance #6",
      "description": "A prayer taught by the Prophet (ﷺ) to seek guidance from Allah.",
      "translation": "O Allah, guide me with those whom You have guided, and strengthen me with those whom You have given strength.",
      "transliteration": "Sahih (Albani). Abu Dawud: 1425",
      "reference": "Sahih (Albani). Abu Dawud: 1425",
      "arabic": "صلاة علمها النبي (ﷺ) لطلب الهداية من الله."
    },
    {
      "_id": "65c1382dc580ef9f80c8f7cb",
      "title": "Asking for forgiveness #1",
      "description": "A supplication seeking forgiveness from Allah, acknowledging the importance of seeking forgiveness for sins.",
      "translation": "O Allah, forgive me and accept my repentance, for You are the Accepter of repentance, the Most Merciful.",
      "transliteration": "Sahih (Albani). Abu Dawud: 1515",
      "reference": "Sahih (Albani). Abu Dawud: 1515",
      "arabic": "دعاء يطلب الغفران من الله، مع الاعتراف بأهمية البحث عن الغفران للخطايا."
    },
    {
      "_id": "65c1382dc580ef9f80c8f7cc",
      "title": "Asking for forgiveness #2",
      "description": "A supplication seeking forgiveness and acceptance of repentance from Allah.",
      "translation": "O Allah forgive me and accept my repentance, for You are the Accepter of repentance, the Most Merciful.",
      "transliteration": "Sahih (Albani). Abu Dawud: 1516",
      "reference": "Sahih (Albani). Abu Dawud: 1516",
      "arabic": "دعاء يطلب الغفران وقبول التوبة من الله."
    },
    {
      "_id": "65c1382dc580ef9f80c8f7cd",
      "title": "Asking for forgiveness #3",
      "description": "A supplication seeking forgiveness from Allah and repentance.",
      "translation": "I seek the forgiveness of Allah the Mighty, Whom there is none worthy of worship except Him, the Living, the Eternal, and I repent to Him.",
      "transliteration": "Sahih (Albani). Tirmidhi: 3577",
      "reference": "Sahih (Albani). Tirmidhi: 3577",
      "arabic": "دعاء يطلب الغفران من الله والتوبة."
    },
    {
      "_id": "65c1382dc580ef9f80c8f7ce",
      "title": "Ask for paradise & protection from fire",
      "description": "A supplication seeking paradise and protection from the Hellfire.",
      "translation": "O Allah, I ask You for Paradise and seek Your protection from the Fire.",
      "transliteration": "Sahih (Albani). Ibn Majah: 910",
      "reference": "Sahih (Albani). Ibn Majah: 910",
      "arabic": "دعاء يطلب الجنة والحماية من النار."
    },
    {
      "_id": "65c1382dc580ef9f80c8f7cf",
      "title": "Seeking good of this world and the hereafter",
      "description": "A supplication seeking goodness in this world and the hereafter.",
      "translation": "O Allah! grant us a good outcome on all of our affairs and save us from the disgrace of this world and the punishment of the Hereafter.",
      "transliteration": "Sahih (Suyuti). Jami'us Sagir: 1450",
      "reference": "Sahih (Suyuti). Jami'us Sagir: 1450",
      "arabic": "دعاء يطلب الخير في الدنيا والآخرة."
    },
    {
      "_id": "65c1382dc580ef9f80c8f7d0",
      "title": "Dua to remain steadfast on the religion",
      "description": "A supplication seeking stability in religion and good results in all deeds.",
      "translation": "O Allah! Controller of the hearts, direct our hearts to Your obedience.",
      "transliteration": "Muslim: 2655",
      "reference": "Muslim: 2655",
      "category": "Dua to remain steadfast on the religion",
      "arabic": "دعاء يطلب الاستقرار في الدين وتحقيق نتائج جيدة في جميع الأعمال."
    },
    {
      "_id": "65c1382dc580ef9f80c8f7d1",
      "title": "Dua to remain steadfast on Islam",
      "description": "A supplication seeking steadfastness on Islam till the day of meeting Allah.",
      "translation": "O guardian of Islam and Muslims, keep me steadfast on Islam till the day when I will have the good fortune to meet you.",
      "transliteration": "Proved on the basis of all sanads (Albani). Silsilatus Sahihah 1823",
      "reference": "Proved on the basis of all sanads (Albani). Silsilatus Sahihah 1823",
      "category": "Dua to remain steadfast on Islam",
      "arabic": "دعاء يطلب الثبات على الإسلام حتى يوم لقاء الله."
    },
    {
      "_id": "65c1382dc580ef9f80c8f7d2",
      "title": "Dua of good outcome in all deeds",
      "description": "A supplication seeking good results and protection in all activities.",
      "translation": "O Allah, grant us a good outcome on all of our affairs and save us from the disgrace of this world and the punishment of the Hereafter.",
      "transliteration": "Sahih (Suyuti). Jami'us Sagir: 1450",
      "reference": "Sahih (Suyuti). Jami'us Sagir: 1450",
      "category": "Dua of good outcome in all deeds",
      "arabic": "دعاء يطلب تحقيق نتائج جيدة وحماية في جميع الأنشطة."
    },
    {
      "_id": "65c1382dc580ef9f80c8f7d3",
      "title": "Seeking whatever good Allah can bestow",
      "description": "A supplication seeking the good of this world and the hereafter.",
      "translation": "O Allah perfect for me my religion on which success of all my affairs depends...",
      "transliteration": "Muslim: 2720",
      "reference": "Muslim: 2720",
      "category": "Seeking whatever good Allah can bestow",
      "arabic": "دعاء يطلب خير الدنيا والآخرة."
    },
    {
      "_id": "65c1382dc580ef9f80c8f7d4",
      "title": "Shelter from evil consequences and rejoicing of the enemy",
      "description": "A supplication seeking shelter from evil consequences and the joy of enemies.",
      "translation": "O Allah, I seek refuge in you from grief and sadness, from weakness and from laziness...",
      "transliteration": "Bukhari :2893",
      "reference": "Bukhari :2893",
      "category": "Shelter from horror, misery, evil consequences and rejoicing of the enemy",
      "arabic": "دعاء يطلب اللجوء من النتائج السيئة وفرح الأعداء."
    }
  ]